#      Функции - генераторы
# Вычисляем среднее арифм-е
# 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
# 2, 3, 4, 5, 6, 7, 8, 9, 10
# 3, 4, 5, 6, 7, 8, 9, 10
# 4, 5, 6, 7, 8, 9, 10
# 5, 6, 7, 8, 9, 10
# 6, 7, 8, 9, 10
# 7, 8, 9, 10
# 8, 9, 10
# 9, 10

def get_list():
    for i in range(1, 10):       # 1-й генератор от 1 до 9, т.к. у нас 9 строк
        a = range(i, 11)         # 2-й генератор от i до 10
        yield sum(a)/ len(a)     # делим сумму строки на количество чисел в строке

a = get_list()
print(list(a))